Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1299NCZAD.svd
        <register>
          <name>USTAT</name>
          <description>ADC Underflow Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>ADC_USTAT_UV0</name>
              <description>SS0 FIFO Underflow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV1</name>
              <description>SS1 FIFO Underflow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV2</name>
              <description>SS2 FIFO Underflow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV3</name>
              <description>SS3 FIFO Underflow</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSEL</name>
          <description>ADC Trigger Source Select</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>ADC_TSSEL_PS0</name>
              <description>Generator 0 PWM Module Trigger Select</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS0_0</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS1</name>
              <description>Generator 1 PWM Module Trigger Select</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS1_0</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS2</name>
              <description>Generator 2 PWM Module Trigger Select</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS2_0</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS3</name>
              <description>Generator 3 PWM Module Trigger Select</description>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS3_0</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPRI</name>
          <description>ADC Sample Sequencer Priority</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>ADC_SSPRI_SS0</name>
              <description>SS0 Priority</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSPRI_SS1</name>
              <description>SS1 Priority</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSPRI_SS2</name>
              <description>SS2 Priority</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSPRI_SS3</name>
              <description>SS3 Priority</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPC</name>
          <description>ADC Sample Phase Control</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>ADC_SPC_PHASE</name>
              <description>Phase Difference</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_0</name>
                  <description>ADC sample lags by 0.0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_22_5</name>
                  <description>ADC sample lags by 22.5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_45</name>
                  <description>ADC sample lags by 45.0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_67_5</name>
                  <description>ADC sample lags by 67.5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_90</name>
                  <description>ADC sample lags by 90.0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_112_5</name>
                  <description>ADC sample lags by 112.5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_135</name>
                  <description>ADC sample lags by 135.0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_157_5</name>
                  <description>ADC sample lags by 157.5</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_180</name>
                  <description>ADC sample lags by 180.0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_202_5</name>
                  <description>ADC sample lags by 202.5</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_225</name>
                  <description>ADC sample lags by 225.0</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_247_5</name>
                  <description>ADC sample lags by 247.5</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_270</name>
                  <description>ADC sample lags by 270.0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_292_5</name>
                  <description>ADC sample lags by 292.5</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_315</name>
                  <description>ADC sample lags by 315.0</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_337_5</name>
                  <description>ADC sample lags by 337.5</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSSI</name>
          <description>ADC Processor Sample Sequence Initiate</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>ADC_PSSI_SS0</name>
              <description>SS0 Initiate</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_PSSI_SS1</name>
              <description>SS1 Initiate</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_PSSI_SS2</name>
              <description>SS2 Initiate</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_PSSI_SS3</name>
              <description>SS3 Initiate</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_PSSI_SYNCWAIT</name>
              <description>Synchronize Wait</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADC_PSSI_GSYNC</name>
              <description>Global Synchronize</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SAC</name>
          <description>ADC Sample Averaging Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>ADC_SAC_AVG</name>
              <description>Hardware Averaging Control</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_OFF</name>
                  <description>No hardware oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_2X</name>
                  <description>2x hardware oversampling</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_4X</name>
                  <description>4x hardware oversampling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_8X</name>
                  <description>8x hardware oversampling</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_16X</name>
                  <description>16x hardware oversampling</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_32X</name>
                  <description>32x hardware oversampling</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_64X</name>
                  <description>64x hardware oversampling</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISC</name>
          <description>ADC Digital Comparator Interrupt Status and Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>ADC_DCISC_DCINT0</name>
              <description>Digital Comparator 0 Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT1</name>
              <description>Digital Comparator 1 Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT2</name>
              <description>Digital Comparator 2 Interrupt Status and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT3</name>
              <description>Digital Comparator 3 Interrupt Status and Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT4</name>
              <description>Digital Comparator 4 Interrupt Status and Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT5</name>
              <description>Digital Comparator 5 Interrupt Status and Clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT6</name>
              <description>Digital Comparator 6 Interrupt Status and Clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_DCISC_DCINT7</name>
              <description>Digital Comparator 7 Interrupt Status and Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>ADC Control</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>ADC_CTL_VREF</name>
              <description>Voltage Reference Select</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_INTERNAL</name>
                  <description>VDDA and GNDA are the voltage references</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_EXT_3V</name>
                  <description>The external VREFA+ and VREFA- inputs are the voltage references</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_CTL_DITHER</name>
              <description>Dither Mode Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX0</name>
          <description>ADC Sample Sequence Input Multiplexer Select 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX0_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX4</name>
              <description>5th Sample Input Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX5</name>
              <description>6th Sample Input Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX6</name>
              <description>7th Sample Input Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX7</name>
              <description>8th Sample Input Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL0</name>
          <description>ADC Sample Sequence Control 0</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL0_D0</name>
              <description>1st Sample Differential Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D1</name>
              <description>2nd Sample Differential Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D2</name>
              <description>3rd Sample Differential Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D3</name>
              <description>4th Sample Differential Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D4</name>
              <description>5th Sample Differential Input Select</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END4</name>
              <description>5th Sample is End of Sequence</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE4</name>
              <description>5th Sample Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS4</name>
              <description>5th Sample Temp Sensor Select</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D5</name>
              <description>6th Sample Differential Input Select</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END5</name>
              <description>6th Sample is End of Sequence</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE5</name>
              <description>6th Sample Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS5</name>
              <description>6th Sample Temp Sensor Select</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D6</name>
              <description>7th Sample Differential Input Select</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END6</name>
              <description>7th Sample is End of Sequence</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE6</name>
              <description>7th Sample Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS6</name>
              <description>7th Sample Temp Sensor Select</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D7</name>
              <description>8th Sample Differential Input Select</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END7</name>
              <description>8th Sample is End of Sequence</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE7</name>
              <description>8th Sample Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS7</name>
              <description>8th Sample Temp Sensor Select</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO0</name>
          <description>ADC Sample Sequence Result FIFO 0</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO0_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
