Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1299NCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA_AHB</name>
      <description>Register map for GPIOA_AHB peripheral</description>
      <groupName>GPIO</groupName>
      <prependToName>GPIOA_AHB</prependToName>
      <baseAddress>0x40058000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>GPIOA</name><value>0</value></interrupt>
      <registers>
        <register>
          <name>DATA</name>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
        </register>
        <register>
          <name>DIR</name>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
        </register>
        <register>
          <name>IS</name>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
        </register>
        <register>
          <name>IBE</name>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
        </register>
        <register>
          <name>IEV</name>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
        </register>
        <register>
          <name>IM</name>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>GPIO_IM_GPIO</name>
              <description>GPIO Interrupt Mask Enable</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>GPIO_IM_DMAIME</name>
              <description>GPIO uDMA Done Interrupt Mask Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>GPIO_RIS_GPIO</name>
              <description>GPIO Interrupt Raw Status</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>GPIO_RIS_DMARIS</name>
              <description>GPIO uDMA Done Interrupt Raw Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>GPIO_MIS_GPIO</name>
              <description>GPIO Masked Interrupt Status</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>GPIO_MIS_DMAMIS</name>
              <description>GPIO uDMA Done Masked Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>GPIO_ICR_GPIO</name>
              <description>GPIO Interrupt Clear</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_ICR_DMAIC</name>
              <description>GPIO uDMA Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSEL</name>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
        </register>
        <register>
          <name>DR2R</name>
          <description>GPIO 2-mA Drive Select</description>
          <addressOffset>0x00000500</addressOffset>
        </register>
        <register>
          <name>DR4R</name>
          <description>GPIO 4-mA Drive Select</description>
          <addressOffset>0x00000504</addressOffset>
        </register>
        <register>
          <name>DR8R</name>
          <description>GPIO 8-mA Drive Select</description>
          <addressOffset>0x00000508</addressOffset>
        </register>
        <register>
          <name>ODR</name>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
        </register>
        <register>
          <name>PUR</name>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
        </register>
        <register>
          <name>PDR</name>
          <description>GPIO Pull-Down Select</description>
          <addressOffset>0x00000514</addressOffset>
        </register>
        <register>
          <name>SLR</name>
          <description>GPIO Slew Rate Control Select</description>
          <addressOffset>0x00000518</addressOffset>
        </register>
        <register>
          <name>DEN</name>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
        </register>
        <register>
          <name>LOCK</name>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <fields>
            <field>
              <name>GPIO_LOCK</name>
              <description>GPIO Lock</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_LOCK_UNLOCKED</name>
                  <description>The GPIOCR register is unlocked and may be modified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_LOCKED</name>
                  <description>The GPIOCR register is locked and may not be modified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_KEY</name>
                  <description>Unlocks the GPIO_CR register</description>
                  <value>0x4c4f434b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>AMSEL</name>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000528</addressOffset>
        </register>
        <register>
          <name>PCTL</name>
          <description>GPIO Port Control</description>
          <addressOffset>0x0000052C</addressOffset>
        </register>
        <register>
          <name>ADCCTL</name>
          <description>GPIO ADC Control</description>
          <addressOffset>0x00000530</addressOffset>
        </register>
        <register>
          <name>DMACTL</name>
          <description>GPIO DMA Control</description>
          <addressOffset>0x00000534</addressOffset>
        </register>
        <register>
          <name>SI</name>
          <description>GPIO Select Interrupt</description>
          <addressOffset>0x00000538</addressOffset>
          <fields>
            <field>
              <name>GPIO_SI_SUM</name>
              <description>Summary Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR12R</name>
          <description>GPIO 12-mA Drive Select</description>
          <addressOffset>0x0000053C</addressOffset>
          <fields>
            <field>
              <name>GPIO_DR12R_DRV12</name>
              <description>Output Pad 12-mA Drive Enable</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_DR12R_DRV12_12MA</name>
                  <description>The corresponding GPIO pin has 12-mA drive. This encoding is only valid if the GPIOPP EDE bit is set and the appropriate GPIOPC EDM bit field is programmed to 0x3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEPEN</name>
          <description>GPIO Wake Pin Enable</description>
          <addressOffset>0x00000540</addressOffset>
          <fields>
            <field>
              <name>GPIO_WAKEPEN_WAKEP4</name>
              <description>P[4] Wake Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKELVL</name>
          <description>GPIO Wake Level</description>
          <addressOffset>0x00000544</addressOffset>
          <fields>
            <field>
              <name>GPIO_WAKELVL_WAKELVL4</name>
              <description>P[4] Wake Level</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKESTAT</name>
          <description>GPIO Wake Status</description>
          <addressOffset>0x00000548</addressOffset>
          <fields>
            <field>
              <name>GPIO_WAKESTAT_STAT4</name>
              <description>P[4] Wake Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>GPIO Peripheral Property</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>GPIO_PP_EDE</name>
              <description>Extended Drive Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>GPIO Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>GPIO_PC_EDM0</name>
              <description>Extended Drive Mode Bit 0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_PC_EDM0_DISABLE</name>
                  <description>Drive values of 2, 4 and 8 mA are maintained. GPIO n Drive Select (GPIODRnR) registers function as normal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_PC_EDM0_6MA</name>
                  <description>An additional 6 mA option is provided</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_PC_EDM0_PLUS2MA</name>
                  <description>A 2 mA driver is always enabled; setting the corresponding GPIODR4R register bit adds 2 mA and setting the corresponding GPIODR8R of GPIODR12R register bit adds an additional 4 mA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_PC_EDM1</name>
              <description>Extended Drive Mode Bit 1</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM2</name>
              <description>Extended Drive Mode Bit 2</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM3</name>
              <description>Extended Drive Mode Bit 3</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM4</name>
              <description>Extended Drive Mode Bit 4</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM5</name>
              <description>Extended Drive Mode Bit 5</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM6</name>
              <description>Extended Drive Mode Bit 6</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>GPIO_PC_EDM7</name>
              <description>Extended Drive Mode Bit 7</description>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
